/*
// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, 
// а какое меньшее.
int a = 0;
int b = 0;
Console.WriteLine("Введите первое число: ");
a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число: ");
b = Convert.ToInt32(Console.ReadLine());
if (a > b) Console.WriteLine($"max = {a}");
    Console.WriteLine($"max = {b}");
    */

// Напишите программу, которая принимает на вход три числа и выдает максимальное